---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GuideGridNameParam
source: html/b8e20dfe-f5ff-ebe7-fc9a-0715f4443f84.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GuideGridNameParam Property

"Name"

## Syntax (C#)
```csharp
public static ForgeTypeId GuideGridNameParam { get; }
```